spt/spt_identity_stress.log

         /\      Grafana   /â€¾â€¾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   â€¾â€¾\ 
  /          \   |   (  |  (â€¾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: spt/identity-spt.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 4m30s max duration (incl. graceful stop):
              * stress: Up to 50 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 00/50 VUs, 0 complete and 0 interrupted iterations
stress   [   0% ] 00/50 VUs  0m01.0s/4m00.0s

running (0m02.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
stress   [   1% ] 01/50 VUs  0m02.0s/4m00.0s

running (0m03.0s), 02/50 VUs, 0 complete and 0 interrupted iterations
stress   [   1% ] 02/50 VUs  0m03.0s/4m00.0s

running (0m04.0s), 03/50 VUs, 0 complete and 0 interrupted iterations
stress   [   2% ] 03/50 VUs  0m04.0s/4m00.0s

running (0m05.0s), 04/50 VUs, 0 complete and 0 interrupted iterations
stress   [   2% ] 04/50 VUs  0m05.0s/4m00.0s

running (0m06.0s), 04/50 VUs, 0 complete and 0 interrupted iterations
stress   [   2% ] 04/50 VUs  0m06.0s/4m00.0s

running (0m07.0s), 05/50 VUs, 0 complete and 0 interrupted iterations
stress   [   3% ] 05/50 VUs  0m07.0s/4m00.0s

running (0m08.0s), 06/50 VUs, 0 complete and 0 interrupted iterations
stress   [   3% ] 06/50 VUs  0m08.0s/4m00.0s

running (0m09.0s), 07/50 VUs, 0 complete and 0 interrupted iterations
stress   [   4% ] 07/50 VUs  0m09.0s/4m00.0s

running (0m10.0s), 08/50 VUs, 0 complete and 0 interrupted iterations
stress   [   4% ] 08/50 VUs  0m10.0s/4m00.0s

running (0m11.0s), 09/50 VUs, 0 complete and 0 interrupted iterations
stress   [   5% ] 09/50 VUs  0m11.0s/4m00.0s

running (0m12.0s), 09/50 VUs, 0 complete and 0 interrupted iterations
stress   [   5% ] 09/50 VUs  0m12.0s/4m00.0s

running (0m13.0s), 10/50 VUs, 1 complete and 0 interrupted iterations
stress   [   5% ] 10/50 VUs  0m13.0s/4m00.0s

running (0m14.0s), 11/50 VUs, 1 complete and 0 interrupted iterations
stress   [   6% ] 11/50 VUs  0m14.0s/4m00.0s

running (0m15.0s), 12/50 VUs, 2 complete and 0 interrupted iterations
stress   [   6% ] 12/50 VUs  0m15.0s/4m00.0s

running (0m16.0s), 13/50 VUs, 4 complete and 0 interrupted iterations
stress   [   7% ] 13/50 VUs  0m16.0s/4m00.0s

running (0m17.0s), 14/50 VUs, 4 complete and 0 interrupted iterations
stress   [   7% ] 14/50 VUs  0m17.0s/4m00.0s

running (0m18.0s), 14/50 VUs, 4 complete and 0 interrupted iterations
stress   [   7% ] 14/50 VUs  0m18.0s/4m00.0s

running (0m19.0s), 15/50 VUs, 5 complete and 0 interrupted iterations
stress   [   8% ] 15/50 VUs  0m19.0s/4m00.0s

running (0m20.0s), 16/50 VUs, 5 complete and 0 interrupted iterations
stress   [   8% ] 16/50 VUs  0m20.0s/4m00.0s

running (0m21.0s), 17/50 VUs, 6 complete and 0 interrupted iterations
stress   [   9% ] 17/50 VUs  0m21.0s/4m00.0s

running (0m22.0s), 18/50 VUs, 7 complete and 0 interrupted iterations
stress   [   9% ] 18/50 VUs  0m22.0s/4m00.0s

running (0m23.0s), 19/50 VUs, 7 complete and 0 interrupted iterations
stress   [  10% ] 19/50 VUs  0m23.0s/4m00.0s

running (0m24.0s), 19/50 VUs, 7 complete and 0 interrupted iterations
stress   [  10% ] 19/50 VUs  0m24.0s/4m00.0s

running (0m25.0s), 20/50 VUs, 8 complete and 0 interrupted iterations
stress   [  10% ] 20/50 VUs  0m25.0s/4m00.0s

running (0m26.0s), 21/50 VUs, 8 complete and 0 interrupted iterations
stress   [  11% ] 21/50 VUs  0m26.0s/4m00.0s

running (0m27.0s), 22/50 VUs, 8 complete and 0 interrupted iterations
stress   [  11% ] 22/50 VUs  0m27.0s/4m00.0s

running (0m28.0s), 23/50 VUs, 10 complete and 0 interrupted iterations
stress   [  12% ] 23/50 VUs  0m28.0s/4m00.0s

running (0m29.0s), 24/50 VUs, 10 complete and 0 interrupted iterations
stress   [  12% ] 24/50 VUs  0m29.0s/4m00.0s

running (0m30.0s), 24/50 VUs, 11 complete and 0 interrupted iterations
stress   [  12% ] 24/50 VUs  0m30.0s/4m00.0s

running (0m31.0s), 25/50 VUs, 13 complete and 0 interrupted iterations
stress   [  13% ] 25/50 VUs  0m31.0s/4m00.0s

running (0m32.0s), 26/50 VUs, 13 complete and 0 interrupted iterations
stress   [  13% ] 26/50 VUs  0m32.0s/4m00.0s

running (0m33.0s), 27/50 VUs, 15 complete and 0 interrupted iterations
stress   [  14% ] 27/50 VUs  0m33.0s/4m00.0s

running (0m34.0s), 28/50 VUs, 15 complete and 0 interrupted iterations
stress   [  14% ] 28/50 VUs  0m34.0s/4m00.0s

running (0m35.0s), 29/50 VUs, 17 complete and 0 interrupted iterations
stress   [  15% ] 29/50 VUs  0m35.0s/4m00.0s

running (0m36.0s), 29/50 VUs, 17 complete and 0 interrupted iterations
stress   [  15% ] 29/50 VUs  0m36.0s/4m00.0s

running (0m37.0s), 30/50 VUs, 17 complete and 0 interrupted iterations
stress   [  15% ] 30/50 VUs  0m37.0s/4m00.0s

running (0m38.0s), 31/50 VUs, 19 complete and 0 interrupted iterations
stress   [  16% ] 31/50 VUs  0m38.0s/4m00.0s

running (0m39.0s), 32/50 VUs, 20 complete and 0 interrupted iterations
stress   [  16% ] 32/50 VUs  0m39.0s/4m00.0s

running (0m40.0s), 33/50 VUs, 20 complete and 0 interrupted iterations
stress   [  17% ] 33/50 VUs  0m40.0s/4m00.0s

running (0m41.0s), 34/50 VUs, 20 complete and 0 interrupted iterations
stress   [  17% ] 34/50 VUs  0m41.0s/4m00.0s

running (0m42.0s), 34/50 VUs, 21 complete and 0 interrupted iterations
stress   [  17% ] 34/50 VUs  0m42.0s/4m00.0s

running (0m43.0s), 35/50 VUs, 22 complete and 0 interrupted iterations
stress   [  18% ] 35/50 VUs  0m43.0s/4m00.0s

running (0m44.0s), 36/50 VUs, 24 complete and 0 interrupted iterations
stress   [  18% ] 36/50 VUs  0m44.0s/4m00.0s

running (0m45.0s), 37/50 VUs, 25 complete and 0 interrupted iterations
stress   [  19% ] 37/50 VUs  0m45.0s/4m00.0s

running (0m46.0s), 38/50 VUs, 26 complete and 0 interrupted iterations
stress   [  19% ] 38/50 VUs  0m46.0s/4m00.0s

running (0m47.0s), 39/50 VUs, 27 complete and 0 interrupted iterations
stress   [  20% ] 39/50 VUs  0m47.0s/4m00.0s

running (0m48.0s), 39/50 VUs, 27 complete and 0 interrupted iterations
stress   [  20% ] 39/50 VUs  0m48.0s/4m00.0s

running (0m49.0s), 40/50 VUs, 27 complete and 0 interrupted iterations
stress   [  20% ] 40/50 VUs  0m49.0s/4m00.0s

running (0m50.0s), 41/50 VUs, 27 complete and 0 interrupted iterations
stress   [  21% ] 41/50 VUs  0m50.0s/4m00.0s

running (0m51.0s), 42/50 VUs, 27 complete and 0 interrupted iterations
stress   [  21% ] 42/50 VUs  0m51.0s/4m00.0s

running (0m52.0s), 43/50 VUs, 27 complete and 0 interrupted iterations
stress   [  22% ] 43/50 VUs  0m52.0s/4m00.0s

running (0m53.0s), 44/50 VUs, 28 complete and 0 interrupted iterations
stress   [  22% ] 44/50 VUs  0m53.0s/4m00.0s

running (0m54.0s), 44/50 VUs, 30 complete and 0 interrupted iterations
stress   [  22% ] 44/50 VUs  0m54.0s/4m00.0s

running (0m55.0s), 45/50 VUs, 32 complete and 0 interrupted iterations
stress   [  23% ] 45/50 VUs  0m55.0s/4m00.0s

running (0m56.0s), 46/50 VUs, 32 complete and 0 interrupted iterations
stress   [  23% ] 46/50 VUs  0m56.0s/4m00.0s

running (0m57.0s), 47/50 VUs, 33 complete and 0 interrupted iterations
stress   [  24% ] 47/50 VUs  0m57.0s/4m00.0s

running (0m58.0s), 48/50 VUs, 35 complete and 0 interrupted iterations
stress   [  24% ] 48/50 VUs  0m58.0s/4m00.0s

running (0m59.0s), 49/50 VUs, 37 complete and 0 interrupted iterations
stress   [  25% ] 49/50 VUs  0m59.0s/4m00.0s

running (1m00.0s), 49/50 VUs, 37 complete and 0 interrupted iterations
stress   [  25% ] 49/50 VUs  1m00.0s/4m00.0s

running (1m01.0s), 50/50 VUs, 37 complete and 0 interrupted iterations
stress   [  25% ] 50/50 VUs  1m01.0s/4m00.0s

running (1m02.0s), 50/50 VUs, 38 complete and 0 interrupted iterations
stress   [  26% ] 50/50 VUs  1m02.0s/4m00.0s

running (1m03.0s), 50/50 VUs, 39 complete and 0 interrupted iterations
stress   [  26% ] 50/50 VUs  1m03.0s/4m00.0s

running (1m04.0s), 50/50 VUs, 39 complete and 0 interrupted iterations
stress   [  27% ] 50/50 VUs  1m04.0s/4m00.0s

running (1m05.0s), 50/50 VUs, 42 complete and 0 interrupted iterations
stress   [  27% ] 50/50 VUs  1m05.0s/4m00.0s

running (1m06.0s), 50/50 VUs, 42 complete and 0 interrupted iterations
stress   [  27% ] 50/50 VUs  1m06.0s/4m00.0s

running (1m07.0s), 50/50 VUs, 44 complete and 0 interrupted iterations
stress   [  28% ] 50/50 VUs  1m07.0s/4m00.0s

running (1m08.0s), 50/50 VUs, 44 complete and 0 interrupted iterations
stress   [  28% ] 50/50 VUs  1m08.0s/4m00.0s

running (1m09.0s), 50/50 VUs, 46 complete and 0 interrupted iterations
stress   [  29% ] 50/50 VUs  1m09.0s/4m00.0s

running (1m10.0s), 50/50 VUs, 47 complete and 0 interrupted iterations
stress   [  29% ] 50/50 VUs  1m10.0s/4m00.0s

running (1m11.0s), 50/50 VUs, 48 complete and 0 interrupted iterations
stress   [  30% ] 50/50 VUs  1m11.0s/4m00.0s

running (1m12.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
stress   [  30% ] 50/50 VUs  1m12.0s/4m00.0s

running (1m13.0s), 50/50 VUs, 51 complete and 0 interrupted iterations
stress   [  30% ] 50/50 VUs  1m13.0s/4m00.0s

running (1m14.0s), 50/50 VUs, 51 complete and 0 interrupted iterations
stress   [  31% ] 50/50 VUs  1m14.0s/4m00.0s

running (1m15.0s), 50/50 VUs, 52 complete and 0 interrupted iterations
stress   [  31% ] 50/50 VUs  1m15.0s/4m00.0s

running (1m16.0s), 50/50 VUs, 53 complete and 0 interrupted iterations
stress   [  32% ] 50/50 VUs  1m16.0s/4m00.0s

running (1m17.0s), 50/50 VUs, 54 complete and 0 interrupted iterations
stress   [  32% ] 50/50 VUs  1m17.0s/4m00.0s

running (1m18.0s), 50/50 VUs, 54 complete and 0 interrupted iterations
stress   [  32% ] 50/50 VUs  1m18.0s/4m00.0s

running (1m19.0s), 50/50 VUs, 56 complete and 0 interrupted iterations
stress   [  33% ] 50/50 VUs  1m19.0s/4m00.0s

running (1m20.0s), 50/50 VUs, 57 complete and 0 interrupted iterations
stress   [  33% ] 50/50 VUs  1m20.0s/4m00.0s

running (1m21.0s), 50/50 VUs, 58 complete and 0 interrupted iterations
stress   [  34% ] 50/50 VUs  1m21.0s/4m00.0s

running (1m22.0s), 50/50 VUs, 58 complete and 0 interrupted iterations
stress   [  34% ] 50/50 VUs  1m22.0s/4m00.0s

running (1m23.0s), 50/50 VUs, 59 complete and 0 interrupted iterations
stress   [  35% ] 50/50 VUs  1m23.0s/4m00.0s

running (1m24.0s), 50/50 VUs, 62 complete and 0 interrupted iterations
stress   [  35% ] 50/50 VUs  1m24.0s/4m00.0s

running (1m25.0s), 50/50 VUs, 63 complete and 0 interrupted iterations
stress   [  35% ] 50/50 VUs  1m25.0s/4m00.0s

running (1m26.0s), 50/50 VUs, 63 complete and 0 interrupted iterations
stress   [  36% ] 50/50 VUs  1m26.0s/4m00.0s

running (1m27.0s), 50/50 VUs, 66 complete and 0 interrupted iterations
stress   [  36% ] 50/50 VUs  1m27.0s/4m00.0s

running (1m28.0s), 50/50 VUs, 66 complete and 0 interrupted iterations
stress   [  37% ] 50/50 VUs  1m28.0s/4m00.0s

running (1m29.0s), 50/50 VUs, 66 complete and 0 interrupted iterations
stress   [  37% ] 50/50 VUs  1m29.0s/4m00.0s

running (1m30.0s), 50/50 VUs, 68 complete and 0 interrupted iterations
stress   [  37% ] 50/50 VUs  1m30.0s/4m00.0s

running (1m31.0s), 50/50 VUs, 70 complete and 0 interrupted iterations
stress   [  38% ] 50/50 VUs  1m31.0s/4m00.0s

running (1m32.0s), 50/50 VUs, 71 complete and 0 interrupted iterations
stress   [  38% ] 50/50 VUs  1m32.0s/4m00.0s

running (1m33.0s), 50/50 VUs, 77 complete and 0 interrupted iterations
stress   [  39% ] 50/50 VUs  1m33.0s/4m00.0s

running (1m34.0s), 50/50 VUs, 79 complete and 0 interrupted iterations
stress   [  39% ] 50/50 VUs  1m34.0s/4m00.0s

running (1m35.0s), 50/50 VUs, 80 complete and 0 interrupted iterations
stress   [  40% ] 50/50 VUs  1m35.0s/4m00.0s

running (1m36.0s), 50/50 VUs, 81 complete and 0 interrupted iterations
stress   [  40% ] 50/50 VUs  1m36.0s/4m00.0s

running (1m37.0s), 50/50 VUs, 82 complete and 0 interrupted iterations
stress   [  40% ] 50/50 VUs  1m37.0s/4m00.0s

running (1m38.0s), 50/50 VUs, 83 complete and 0 interrupted iterations
stress   [  41% ] 50/50 VUs  1m38.0s/4m00.0s

running (1m39.0s), 50/50 VUs, 83 complete and 0 interrupted iterations
stress   [  41% ] 50/50 VUs  1m39.0s/4m00.0s

running (1m40.0s), 50/50 VUs, 84 complete and 0 interrupted iterations
stress   [  42% ] 50/50 VUs  1m40.0s/4m00.0s

running (1m41.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
stress   [  42% ] 50/50 VUs  1m41.0s/4m00.0s

running (1m42.0s), 50/50 VUs, 88 complete and 0 interrupted iterations
stress   [  42% ] 50/50 VUs  1m42.0s/4m00.0s

running (1m43.0s), 50/50 VUs, 92 complete and 0 interrupted iterations
stress   [  43% ] 50/50 VUs  1m43.0s/4m00.0s

running (1m44.0s), 50/50 VUs, 92 complete and 0 interrupted iterations
stress   [  43% ] 50/50 VUs  1m44.0s/4m00.0s

running (1m45.0s), 50/50 VUs, 92 complete and 0 interrupted iterations
stress   [  44% ] 50/50 VUs  1m45.0s/4m00.0s

running (1m46.0s), 50/50 VUs, 93 complete and 0 interrupted iterations
stress   [  44% ] 50/50 VUs  1m46.0s/4m00.0s

running (1m47.0s), 50/50 VUs, 93 complete and 0 interrupted iterations
stress   [  45% ] 50/50 VUs  1m47.0s/4m00.0s

running (1m48.0s), 50/50 VUs, 96 complete and 0 interrupted iterations
stress   [  45% ] 50/50 VUs  1m48.0s/4m00.0s

running (1m49.0s), 50/50 VUs, 97 complete and 0 interrupted iterations
stress   [  45% ] 50/50 VUs  1m49.0s/4m00.0s

running (1m50.0s), 50/50 VUs, 99 complete and 0 interrupted iterations
stress   [  46% ] 50/50 VUs  1m50.0s/4m00.0s

running (1m51.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
stress   [  46% ] 50/50 VUs  1m51.0s/4m00.0s

running (1m52.0s), 50/50 VUs, 102 complete and 0 interrupted iterations
stress   [  47% ] 50/50 VUs  1m52.0s/4m00.0s

running (1m53.0s), 50/50 VUs, 102 complete and 0 interrupted iterations
stress   [  47% ] 50/50 VUs  1m53.0s/4m00.0s

running (1m54.0s), 50/50 VUs, 102 complete and 0 interrupted iterations
stress   [  47% ] 50/50 VUs  1m54.0s/4m00.0s

running (1m55.0s), 50/50 VUs, 104 complete and 0 interrupted iterations
stress   [  48% ] 50/50 VUs  1m55.0s/4m00.0s

running (1m56.0s), 50/50 VUs, 105 complete and 0 interrupted iterations
stress   [  48% ] 50/50 VUs  1m56.0s/4m00.0s

running (1m57.0s), 50/50 VUs, 106 complete and 0 interrupted iterations
stress   [  49% ] 50/50 VUs  1m57.0s/4m00.0s

running (1m58.0s), 50/50 VUs, 107 complete and 0 interrupted iterations
stress   [  49% ] 50/50 VUs  1m58.0s/4m00.0s

running (1m59.0s), 50/50 VUs, 107 complete and 0 interrupted iterations
stress   [  50% ] 50/50 VUs  1m59.0s/4m00.0s

running (2m00.0s), 50/50 VUs, 107 complete and 0 interrupted iterations
stress   [  50% ] 50/50 VUs  2m00.0s/4m00.0s

running (2m01.0s), 50/50 VUs, 108 complete and 0 interrupted iterations
stress   [  50% ] 50/50 VUs  2m01.0s/4m00.0s

running (2m02.0s), 50/50 VUs, 108 complete and 0 interrupted iterations
stress   [  51% ] 50/50 VUs  2m02.0s/4m00.0s

running (2m03.0s), 50/50 VUs, 109 complete and 0 interrupted iterations
stress   [  51% ] 50/50 VUs  2m03.0s/4m00.0s

running (2m04.0s), 50/50 VUs, 111 complete and 0 interrupted iterations
stress   [  52% ] 50/50 VUs  2m04.0s/4m00.0s

running (2m05.0s), 50/50 VUs, 112 complete and 0 interrupted iterations
stress   [  52% ] 50/50 VUs  2m05.0s/4m00.0s

running (2m06.0s), 50/50 VUs, 115 complete and 0 interrupted iterations
stress   [  52% ] 50/50 VUs  2m06.0s/4m00.0s

running (2m07.0s), 50/50 VUs, 117 complete and 0 interrupted iterations
stress   [  53% ] 50/50 VUs  2m07.0s/4m00.0s

running (2m08.0s), 50/50 VUs, 118 complete and 0 interrupted iterations
stress   [  53% ] 50/50 VUs  2m08.0s/4m00.0s

running (2m09.0s), 50/50 VUs, 119 complete and 0 interrupted iterations
stress   [  54% ] 50/50 VUs  2m09.0s/4m00.0s

running (2m10.0s), 50/50 VUs, 119 complete and 0 interrupted iterations
stress   [  54% ] 50/50 VUs  2m10.0s/4m00.0s

running (2m11.0s), 50/50 VUs, 119 complete and 0 interrupted iterations
stress   [  55% ] 50/50 VUs  2m11.0s/4m00.0s

running (2m12.0s), 50/50 VUs, 119 complete and 0 interrupted iterations
stress   [  55% ] 50/50 VUs  2m12.0s/4m00.0s

running (2m13.0s), 50/50 VUs, 122 complete and 0 interrupted iterations
stress   [  55% ] 50/50 VUs  2m13.0s/4m00.0s

running (2m14.0s), 50/50 VUs, 127 complete and 0 interrupted iterations
stress   [  56% ] 50/50 VUs  2m14.0s/4m00.0s

running (2m15.0s), 50/50 VUs, 129 complete and 0 interrupted iterations
stress   [  56% ] 50/50 VUs  2m15.0s/4m00.0s

running (2m16.0s), 50/50 VUs, 133 complete and 0 interrupted iterations
stress   [  57% ] 50/50 VUs  2m16.0s/4m00.0s

running (2m17.0s), 50/50 VUs, 134 complete and 0 interrupted iterations
stress   [  57% ] 50/50 VUs  2m17.0s/4m00.0s

running (2m18.0s), 50/50 VUs, 134 complete and 0 interrupted iterations
stress   [  58% ] 50/50 VUs  2m18.0s/4m00.0s

running (2m19.0s), 50/50 VUs, 136 complete and 0 interrupted iterations
stress   [  58% ] 50/50 VUs  2m19.0s/4m00.0s

running (2m20.0s), 50/50 VUs, 138 complete and 0 interrupted iterations
stress   [  58% ] 50/50 VUs  2m20.0s/4m00.0s

running (2m21.0s), 50/50 VUs, 139 complete and 0 interrupted iterations
stress   [  59% ] 50/50 VUs  2m21.0s/4m00.0s

running (2m22.0s), 50/50 VUs, 140 complete and 0 interrupted iterations
stress   [  59% ] 50/50 VUs  2m22.0s/4m00.0s

running (2m23.0s), 50/50 VUs, 141 complete and 0 interrupted iterations
stress   [  60% ] 50/50 VUs  2m23.0s/4m00.0s

running (2m24.0s), 50/50 VUs, 143 complete and 0 interrupted iterations
stress   [  60% ] 50/50 VUs  2m24.0s/4m00.0s

running (2m25.0s), 50/50 VUs, 146 complete and 0 interrupted iterations
stress   [  60% ] 50/50 VUs  2m25.0s/4m00.0s

running (2m26.0s), 50/50 VUs, 148 complete and 0 interrupted iterations
stress   [  61% ] 50/50 VUs  2m26.0s/4m00.0s

running (2m27.0s), 50/50 VUs, 149 complete and 0 interrupted iterations
stress   [  61% ] 50/50 VUs  2m27.0s/4m00.0s

running (2m28.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
stress   [  62% ] 50/50 VUs  2m28.0s/4m00.0s

running (2m29.0s), 50/50 VUs, 152 complete and 0 interrupted iterations
stress   [  62% ] 50/50 VUs  2m29.0s/4m00.0s

running (2m30.0s), 50/50 VUs, 152 complete and 0 interrupted iterations
stress   [  62% ] 50/50 VUs  2m30.0s/4m00.0s

running (2m31.0s), 50/50 VUs, 154 complete and 0 interrupted iterations
stress   [  63% ] 50/50 VUs  2m31.0s/4m00.0s

running (2m32.0s), 50/50 VUs, 156 complete and 0 interrupted iterations
stress   [  63% ] 50/50 VUs  2m32.0s/4m00.0s

running (2m33.0s), 50/50 VUs, 156 complete and 0 interrupted iterations
stress   [  64% ] 50/50 VUs  2m33.0s/4m00.0s

running (2m34.0s), 50/50 VUs, 156 complete and 0 interrupted iterations
stress   [  64% ] 50/50 VUs  2m34.0s/4m00.0s

running (2m35.0s), 50/50 VUs, 156 complete and 0 interrupted iterations
stress   [  65% ] 50/50 VUs  2m35.0s/4m00.0s

running (2m36.0s), 50/50 VUs, 157 complete and 0 interrupted iterations
stress   [  65% ] 50/50 VUs  2m36.0s/4m00.0s

running (2m37.0s), 50/50 VUs, 159 complete and 0 interrupted iterations
stress   [  65% ] 50/50 VUs  2m37.0s/4m00.0s

running (2m38.0s), 50/50 VUs, 159 complete and 0 interrupted iterations
stress   [  66% ] 50/50 VUs  2m38.0s/4m00.0s

running (2m39.0s), 50/50 VUs, 160 complete and 0 interrupted iterations
stress   [  66% ] 50/50 VUs  2m39.0s/4m00.0s

running (2m40.0s), 50/50 VUs, 160 complete and 0 interrupted iterations
stress   [  67% ] 50/50 VUs  2m40.0s/4m00.0s

running (2m41.0s), 50/50 VUs, 160 complete and 0 interrupted iterations
stress   [  67% ] 50/50 VUs  2m41.0s/4m00.0s

running (2m42.0s), 50/50 VUs, 163 complete and 0 interrupted iterations
stress   [  67% ] 50/50 VUs  2m42.0s/4m00.0s

running (2m43.0s), 50/50 VUs, 164 complete and 0 interrupted iterations
stress   [  68% ] 50/50 VUs  2m43.0s/4m00.0s

running (2m44.0s), 50/50 VUs, 165 complete and 0 interrupted iterations
stress   [  68% ] 50/50 VUs  2m44.0s/4m00.0s

running (2m45.0s), 50/50 VUs, 167 complete and 0 interrupted iterations
stress   [  69% ] 50/50 VUs  2m45.0s/4m00.0s

running (2m46.0s), 50/50 VUs, 169 complete and 0 interrupted iterations
stress   [  69% ] 50/50 VUs  2m46.0s/4m00.0s

running (2m47.0s), 50/50 VUs, 169 complete and 0 interrupted iterations
stress   [  70% ] 50/50 VUs  2m47.0s/4m00.0s

running (2m48.0s), 50/50 VUs, 169 complete and 0 interrupted iterations
stress   [  70% ] 50/50 VUs  2m48.0s/4m00.0s

running (2m49.0s), 50/50 VUs, 171 complete and 0 interrupted iterations
stress   [  70% ] 50/50 VUs  2m49.0s/4m00.0s

running (2m50.0s), 50/50 VUs, 173 complete and 0 interrupted iterations
stress   [  71% ] 50/50 VUs  2m50.0s/4m00.0s

running (2m51.0s), 50/50 VUs, 176 complete and 0 interrupted iterations
stress   [  71% ] 50/50 VUs  2m51.0s/4m00.0s

running (2m52.0s), 50/50 VUs, 177 complete and 0 interrupted iterations
stress   [  72% ] 50/50 VUs  2m52.0s/4m00.0s

running (2m53.0s), 50/50 VUs, 179 complete and 0 interrupted iterations
stress   [  72% ] 50/50 VUs  2m53.0s/4m00.0s

running (2m54.0s), 50/50 VUs, 184 complete and 0 interrupted iterations
stress   [  72% ] 50/50 VUs  2m54.0s/4m00.0s

running (2m55.0s), 50/50 VUs, 188 complete and 0 interrupted iterations
stress   [  73% ] 50/50 VUs  2m55.0s/4m00.0s

running (2m56.0s), 50/50 VUs, 189 complete and 0 interrupted iterations
stress   [  73% ] 50/50 VUs  2m56.0s/4m00.0s

running (2m57.0s), 50/50 VUs, 189 complete and 0 interrupted iterations
stress   [  74% ] 50/50 VUs  2m57.0s/4m00.0s

running (2m58.0s), 50/50 VUs, 191 complete and 0 interrupted iterations
stress   [  74% ] 50/50 VUs  2m58.0s/4m00.0s

running (2m59.0s), 50/50 VUs, 191 complete and 0 interrupted iterations
stress   [  75% ] 50/50 VUs  2m59.0s/4m00.0s

running (3m00.0s), 50/50 VUs, 194 complete and 0 interrupted iterations
stress   [  75% ] 50/50 VUs  3m00.0s/4m00.0s

running (3m01.0s), 50/50 VUs, 194 complete and 0 interrupted iterations
stress   [  75% ] 50/50 VUs  3m01.0s/4m00.0s

running (3m02.0s), 50/50 VUs, 195 complete and 0 interrupted iterations
stress   [  76% ] 50/50 VUs  3m02.0s/4m00.0s

running (3m03.0s), 50/50 VUs, 198 complete and 0 interrupted iterations
stress   [  76% ] 50/50 VUs  3m03.0s/4m00.0s

running (3m04.0s), 50/50 VUs, 198 complete and 0 interrupted iterations
stress   [  77% ] 50/50 VUs  3m04.0s/4m00.0s

running (3m05.0s), 50/50 VUs, 199 complete and 0 interrupted iterations
stress   [  77% ] 50/50 VUs  3m05.0s/4m00.0s

running (3m06.0s), 50/50 VUs, 199 complete and 0 interrupted iterations
stress   [  77% ] 50/50 VUs  3m06.0s/4m00.0s

running (3m07.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
stress   [  78% ] 50/50 VUs  3m07.0s/4m00.0s

running (3m08.0s), 50/50 VUs, 201 complete and 0 interrupted iterations
stress   [  78% ] 50/50 VUs  3m08.0s/4m00.0s

running (3m09.0s), 50/50 VUs, 202 complete and 0 interrupted iterations
stress   [  79% ] 50/50 VUs  3m09.0s/4m00.0s

running (3m10.0s), 50/50 VUs, 204 complete and 0 interrupted iterations
stress   [  79% ] 50/50 VUs  3m10.0s/4m00.0s

running (3m11.0s), 50/50 VUs, 205 complete and 0 interrupted iterations
stress   [  80% ] 50/50 VUs  3m11.0s/4m00.0s

running (3m12.0s), 50/50 VUs, 206 complete and 0 interrupted iterations
stress   [  80% ] 50/50 VUs  3m12.0s/4m00.0s

running (3m13.0s), 50/50 VUs, 206 complete and 0 interrupted iterations
stress   [  80% ] 50/50 VUs  3m13.0s/4m00.0s

running (3m14.0s), 50/50 VUs, 208 complete and 0 interrupted iterations
stress   [  81% ] 50/50 VUs  3m14.0s/4m00.0s

running (3m15.0s), 50/50 VUs, 208 complete and 0 interrupted iterations
stress   [  81% ] 50/50 VUs  3m15.0s/4m00.0s

running (3m16.0s), 50/50 VUs, 210 complete and 0 interrupted iterations
stress   [  82% ] 50/50 VUs  3m16.0s/4m00.0s

running (3m17.0s), 50/50 VUs, 210 complete and 0 interrupted iterations
stress   [  82% ] 50/50 VUs  3m17.0s/4m00.0s

running (3m18.0s), 50/50 VUs, 210 complete and 0 interrupted iterations
stress   [  82% ] 50/50 VUs  3m18.0s/4m00.0s

running (3m19.0s), 49/50 VUs, 211 complete and 0 interrupted iterations
stress   [  83% ] 49/50 VUs  3m19.0s/4m00.0s

running (3m20.0s), 49/50 VUs, 211 complete and 0 interrupted iterations
stress   [  83% ] 49/50 VUs  3m20.0s/4m00.0s

running (3m21.0s), 49/50 VUs, 211 complete and 0 interrupted iterations
stress   [  84% ] 49/50 VUs  3m21.0s/4m00.0s

running (3m22.0s), 49/50 VUs, 212 complete and 0 interrupted iterations
stress   [  84% ] 49/50 VUs  3m22.0s/4m00.0s

running (3m23.0s), 46/50 VUs, 215 complete and 0 interrupted iterations
stress   [  85% ] 46/50 VUs  3m23.0s/4m00.0s

running (3m24.0s), 45/50 VUs, 219 complete and 0 interrupted iterations
stress   [  85% ] 45/50 VUs  3m24.0s/4m00.0s

running (3m25.0s), 45/50 VUs, 220 complete and 0 interrupted iterations
stress   [  85% ] 45/50 VUs  3m25.0s/4m00.0s

running (3m26.0s), 45/50 VUs, 221 complete and 0 interrupted iterations
stress   [  86% ] 45/50 VUs  3m26.0s/4m00.0s

running (3m27.0s), 44/50 VUs, 223 complete and 0 interrupted iterations
stress   [  86% ] 44/50 VUs  3m27.0s/4m00.0s

running (3m28.0s), 43/50 VUs, 225 complete and 0 interrupted iterations
stress   [  87% ] 43/50 VUs  3m28.0s/4m00.0s

running (3m29.0s), 43/50 VUs, 226 complete and 0 interrupted iterations
stress   [  87% ] 43/50 VUs  3m29.0s/4m00.0s

running (3m30.0s), 41/50 VUs, 229 complete and 0 interrupted iterations
stress   [  87% ] 41/50 VUs  3m30.0s/4m00.0s

running (3m31.0s), 41/50 VUs, 229 complete and 0 interrupted iterations
stress   [  88% ] 41/50 VUs  3m31.0s/4m00.0s

running (3m32.0s), 39/50 VUs, 233 complete and 0 interrupted iterations
stress   [  88% ] 39/50 VUs  3m32.0s/4m00.0s

running (3m33.0s), 37/50 VUs, 235 complete and 1 interrupted iterations
stress   [  89% ] 37/50 VUs  3m33.0s/4m00.0s

running (3m34.0s), 36/50 VUs, 236 complete and 1 interrupted iterations
stress   [  89% ] 36/50 VUs  3m34.0s/4m00.0s

running (3m35.0s), 36/50 VUs, 236 complete and 1 interrupted iterations
stress   [  90% ] 36/50 VUs  3m35.0s/4m00.0s

running (3m36.0s), 33/50 VUs, 240 complete and 1 interrupted iterations
stress   [  90% ] 33/50 VUs  3m36.0s/4m00.0s

running (3m37.0s), 30/50 VUs, 246 complete and 1 interrupted iterations
stress   [  90% ] 30/50 VUs  3m37.0s/4m00.0s

running (3m38.0s), 30/50 VUs, 247 complete and 1 interrupted iterations
stress   [  91% ] 30/50 VUs  3m38.0s/4m00.0s

running (3m39.0s), 30/50 VUs, 248 complete and 1 interrupted iterations
stress   [  91% ] 30/50 VUs  3m39.0s/4m00.0s

running (3m40.0s), 27/50 VUs, 251 complete and 1 interrupted iterations
stress   [  92% ] 27/50 VUs  3m40.0s/4m00.0s

running (3m41.0s), 26/50 VUs, 255 complete and 1 interrupted iterations
stress   [  92% ] 26/50 VUs  3m41.0s/4m00.0s

running (3m42.0s), 25/50 VUs, 256 complete and 1 interrupted iterations
stress   [  92% ] 25/50 VUs  3m42.0s/4m00.0s

running (3m43.0s), 23/50 VUs, 259 complete and 1 interrupted iterations
stress   [  93% ] 23/50 VUs  3m43.0s/4m00.0s

running (3m44.0s), 23/50 VUs, 259 complete and 1 interrupted iterations
stress   [  93% ] 23/50 VUs  3m44.0s/4m00.0s

running (3m45.0s), 23/50 VUs, 260 complete and 1 interrupted iterations
stress   [  94% ] 23/50 VUs  3m45.0s/4m00.0s

running (3m46.0s), 21/50 VUs, 263 complete and 1 interrupted iterations
stress   [  94% ] 21/50 VUs  3m46.0s/4m00.0s

running (3m47.0s), 20/50 VUs, 264 complete and 1 interrupted iterations
stress   [  95% ] 20/50 VUs  3m47.0s/4m00.0s

running (3m48.0s), 19/50 VUs, 267 complete and 1 interrupted iterations
stress   [  95% ] 19/50 VUs  3m48.0s/4m00.0s

running (3m49.0s), 17/50 VUs, 269 complete and 1 interrupted iterations
stress   [  95% ] 17/50 VUs  3m49.0s/4m00.0s

running (3m50.0s), 16/50 VUs, 271 complete and 1 interrupted iterations
stress   [  96% ] 16/50 VUs  3m50.0s/4m00.0s

running (3m51.0s), 16/50 VUs, 273 complete and 1 interrupted iterations
stress   [  96% ] 16/50 VUs  3m51.0s/4m00.0s

running (3m52.0s), 15/50 VUs, 275 complete and 1 interrupted iterations
stress   [  97% ] 15/50 VUs  3m52.0s/4m00.0s

running (3m53.0s), 13/50 VUs, 277 complete and 1 interrupted iterations
stress   [  97% ] 13/50 VUs  3m53.0s/4m00.0s

running (3m54.0s), 10/50 VUs, 281 complete and 1 interrupted iterations
stress   [  97% ] 10/50 VUs  3m54.0s/4m00.0s

running (3m55.0s), 08/50 VUs, 283 complete and 1 interrupted iterations
stress   [  98% ] 08/50 VUs  3m55.0s/4m00.0s

running (3m56.0s), 08/50 VUs, 283 complete and 1 interrupted iterations
stress   [  98% ] 08/50 VUs  3m56.0s/4m00.0s

running (3m57.0s), 07/50 VUs, 285 complete and 1 interrupted iterations
stress   [  99% ] 07/50 VUs  3m57.0s/4m00.0s

running (3m58.0s), 05/50 VUs, 287 complete and 1 interrupted iterations
stress   [  99% ] 05/50 VUs  3m58.0s/4m00.0s

running (3m59.0s), 05/50 VUs, 287 complete and 1 interrupted iterations
stress   [ 100% ] 05/50 VUs  3m59.0s/4m00.0s

running (4m00.0s), 03/50 VUs, 289 complete and 1 interrupted iterations
stress   [ 100% ] 03/50 VUs  4m00.0s/4m00.0s

running (4m01.0s), 02/50 VUs, 290 complete and 1 interrupted iterations
stress â†“ [ 100% ] 03/50 VUs  4m0s

running (4m02.0s), 02/50 VUs, 290 complete and 1 interrupted iterations
stress â†“ [ 100% ] 03/50 VUs  4m0s

running (4m03.0s), 01/50 VUs, 291 complete and 1 interrupted iterations
stress â†“ [ 100% ] 03/50 VUs  4m0s

running (4m04.0s), 01/50 VUs, 291 complete and 1 interrupted iterations
stress â†“ [ 100% ] 03/50 VUs  4m0s


  â–ˆ THRESHOLDS 

    http_req_failed
    âœ“ 'rate<0.01' rate=0.10%


  â–ˆ TOTAL RESULTS 

    checks_total.......: 879    3.593992/s
    checks_succeeded...: 99.88% 878 out of 879
    checks_failed......: 0.11%  1 out of 879

    âœ“ identity profile is 200
    âœ“ identity request deletion is 200
    âœ— identity restore is 200
      â†³  99% â€” âœ“ 292 / âœ— 1

    HTTP
    http_req_duration..............: avg=9.04s  min=375.21ms med=8.85s max=21.19s p(90)=15.25s p(95)=16.47s
      { expected_response:true }...: avg=9.05s  min=480.5ms  med=8.87s max=21.19s p(90)=15.25s p(95)=16.47s
    http_req_failed................: 0.10%  1 out of 929
    http_reqs......................: 929    3.798428/s

    EXECUTION
    iteration_duration.............: avg=32.72s min=7.99s    med=36.5s max=45.66s p(90)=41.03s p(95)=42.08s
    iterations.....................: 292    1.193909/s
    vus............................: 1      min=0        max=50
    vus_max........................: 50     min=50       max=50

    NETWORK
    data_received..................: 910 kB 3.7 kB/s
    data_sent......................: 203 kB 830 B/s



running (4m04.6s), 00/50 VUs, 292 complete and 1 interrupted iterations
stress âœ“ [ 100% ] 00/50 VUs  4m0s